{
  "questions": [
    {
      "question": "새로운 사람들이나 강아지들과 쉽게 친해지는 것 같다",
      "option": "introversion_extroversion",
      "vector": 1
    },
    {
      "question": "나 또는 가족 구성원의 지시를 잘 따르지 않을 때가 많다",
      "option": "dependence_leadership",
      "vector": 1
    },
    {
      "question": "음식 앞에서는 참을성이 없는 편이다",
      "option": "rationality_emotionality",
      "vector": 1
    },
    {
      "question": "낯선 사물 및 장난감에 금방 적응하는 편이다",
      "option": "introversion_extroversion",
      "vector": 1
    },
    {
      "question": "산책을 자신이 주도한다",
      "option": "dependence_leadership",
      "vector": 1
    },
    {
      "question": "원하는 것이 있을 때, 일부러 사고를 치는 것 같다",
      "option": "rationality_emotionality",
      "vector": 1
    },
    {
      "question": "낯선 환경에서도 도전적으로 행동한다",
      "option": "introversion_extroversion",
      "vector": 1
    },
    {
      "question": "장난감이나 간식을 앞에 두면 이성을 잃는다",
      "option": "dependence_leadership",
      "vector": 1
    },
    {
      "question": "생각보다 행동이 앞선다",
      "option": "rationality_emotionality",
      "vector": 1
    },
    {
      "question": "다른 강아지를 보면 먼저 다가가는 편이다",
      "option": "introversion_extroversion",
      "vector": 1
    },
    {
      "question": "나 또는 가족 구성원의 품이 아니더라도 잘 자는 편이다",
      "option": "dependence_leadership",
      "vector": 1
    },
    {
      "question": "학습 및 훈련에 따라 배운 것을 금방 잊어버린다",
      "option": "rationality_emotionality",
      "vector": 1
    },
    {
      "question": "놀이를 할 때, 경쟁적인 요소를 즐기는 모습을 보인다",
      "option": "introversion_extroversion",
      "vector": 1
    },
    {
      "question": "나 또는 가족 구성원의 외출에도 씩씩하게 기다리는 편이다",
      "option": "dependence_leadership",
      "vector": 1
    },
    {
      "question": "산책 가자는 말에 흥분을 감출 수 없는 편이다",
      "option": "rationality_emotionality",
      "vector": 1
    },
    {
      "question": "자신의 영역에 누군가 들어와도 경계심이 크지 않다",
      "option": "introversion_extroversion",
      "vector": 1
    },
    {
      "question": "낯선 환경에서 나 또는 가족 구성원을 보호하고자 한다",
      "option": "dependence_leadership",
      "vector": 1
    },
    {
      "question": "불편한 상황에서 본인의 감정을 과하게 드러낸다",
      "option": "rationality_emotionality",
      "vector": 1
    },
    {
      "question": "세상이 무너져도 산책은 해야만 한다",
      "option": "introversion_extroversion",
      "vector": 1
    },
    {
      "question": "심심할 때, 자신이 심심하다는 것을 강하게 어필한다",
      "option": "dependence_leadership",
      "vector": 1
    },
    {
      "question": "혼나고 난 후, 혼났다는 사실을 금방 잊어버리는 것 같다",
      "option": "rationality_emotionality",
      "vector": 1
    },
    {
      "question": "미용실 또는 병원에서도 활발하게 행동하는 편이다",
      "option": "introversion_extroversion",
      "vector": 1
    },
    {
      "question": "강아지 세계가 있다면, 대장을 하고 있을 것 같다",
      "option": "dependence_leadership",
      "vector": 1
    },
    {
      "question": "스트레스를 받았을 때, 표현을 강하게 하는 편이다",
      "option": "rationality_emotionality",
      "vector": 1
    }
  ],
  "results": [
    {
      "type": "IDR",
      "name": "견생을 깨우친 요조숙녀",
      "best": "ELE",
      "worst": "ILE",
      "comments": [
        "견생을 깨우친 요조숙녀는 내향적이면서 의존성이 강하지만 이성적인 모습을 보이고 있어요.",
        "다른 강아지에게 적극적으로 다가가지 못하는 성격을 가지고 있어요. 하지만 괜찮아요. 보호자와 함께 있다면 어떠한 일이든 해낼 수 있으니까요. 어떤 상황 속에서 불편한 상황이 생기면 스스로 생각하여 그 상황을 피할 줄 아는 강아지랍니다.",
        "병원에 가는 일과 같은 일도 보호자가 옆에 있다면 그 상황을 이해하고 버틸 수 있어요. 그만큼 보호자를 신뢰하고 의존하기 때문에 보호자 곁에 있을 때는 심리적인 안정감을 찾을 수 있어요.",
        "보호자에게 의지한다고 해서 과잉보호를 하게 되면 보호자에게 의존하는 성격이 심해질 수 있어요. 하지만 교육을 통해서 잘 가르친다면 보호자를 의지하고 따르면서도 독립적인 모습을 볼 수가 있을 텐데, 자신만의 시간을 주는 것도 좋아요.",
        "또한 스스로 생각할 줄 아는 강아지이기 때문에 노즈워크 등의 장난감이 있으면 똑똑하게 잘 가지고 놀 수 있답니다. 그렇지만 가장 좋아하는 것은 내 보호자예요."
      ]
    },
    {
      "type": "IDE",
      "name": "아직은 수줍은 모험가",
      "best": "ELR",
      "worst": "ILR",
      "comments": [
        "아직은 수줍은 모험가는 내향적이긴 하지만 동시에 도전적인 모습을 가지고 있는 멋진 강아지예요.",
        "다른 친구들을 만나는 것은 아직은 많이 낯설어해요. 하지만 시간을 가지고 기다린다면 분명 친구들이 먼저 다가와 친해지게 될 거랍니다. 수줍음이 많아서 친구들에게 먼저 다가간다거나 하는 일은 드물어요. 그럼에도 불구하고 가끔씩은 먼저 도전적인 모습을 보이며 친구들에게 어필할 수 있는 모습도 보여준답니다.",
        "언제라도 가기 싫은 병원이라는 곳으로 모험을 떠나야 할 때라면 숨고 도망가고 싶어 해요. 하지만 가야하기 때문에 병원으로 모험을 떠나요. 보호자가 옆에 있으니까 괜찮으니까요. 보호자를 전적으로 신뢰하기에 병원에서 검사도 잘 받고 치료도 무사히 마칠 수 있어요.",
        "내향적이지만 호기심이 많아서 가끔은 호기심을 참지 못하고 사고를 칠 때가 있을 거예요. 모험심을 키워나가는 중이니까 너무 혼내지는 말아주세요.",
        "아직은 자신감이 필요한 때니까요."
      ]
    },
    {
      "type": "ILR",
      "name": "주도면밀한 전략가",
      "best": "EDE",
      "worst": "EDR",
      "comments": [
        "주도면밀한 전략가는 내향적이지만 주도면밀한 모습을 가지고 있는 치밀한 강아지예요.",
        "산책을 할 때는 에너지가 넘쳐요. 먼저 가고 싶은 곳을 향해서 달려갈 거예요. 하지만 친구들에게 먼저 다가가지는 못해요. 아직은 먼저 다가가기엔 쑥스럽고 부끄럽거든요. 보호자와 있을 때는 자신감이 넘쳐요.",
        "때로는 예민하고 조심스러운 모습을 보일 수가 있어요. 신중하게 관찰하는 성격을 가지고 있으니 보호자가 곁에서 지켜봐주세요. 보호자와의 교감이 높기 때문에 보호자가 옆에서 기를 불어넣어 주면 어떤 일이든지 혼자 스스로 해낼 수 있는 멋진 강아지가 될 거예요.",
        "대부분의 자극에 대해서 먼저 적극적으로 다가가는 모습보다 주의 깊게 관찰하며 조심스럽게 다가가는 모습을 보일 거예요. 그럴 때는 너무 옆에서 자극하지 말아주세요. 원래 성격이 신중하고 조심스럽기 때문에 관찰하는 시간이 조금 길기 때문이에요.",
        "불안함이나 두려워하는 상황이 생기게 되면 생각을 하다가 해결책을 찾거나 보호자 옆에서 떠나지 않을 거예요. 어떤 일에 두려움을 갖게 될지 모르니 보호자가 항상 잘 살펴봐 주셔야 합니다."
      ]
    },
    {
      "type": "ILE",
      "name": "못 말리는 사고뭉치",
      "best": "IDE",
      "worst": "ELE",
      "comments": [
        "못 말리는 사고뭉치는 처음은 조심스럽지만 곧 적응을 잘하는 귀여운 강아지예요.",
        "대부분의 상황에 의연한 모습을 보여줘요. 낯선 것을 마주할 때면 조심스럽게 주위를 탐색하며 관찰하는 편이에요. 새로운 자극에 처음에는 경계하지만 곧잘 적응하는 모습을 보여주고 있기 때문에 새로운 경험을 하는데 긴 시간이 필요하지 않아요.",
        "심리적으로 안정적인 상태를 가지고 적응을 다 하고 나면 이제부터 내 세상이나 마찬가지예요. 이때부터 조용히 사고를 칠 수 있어요. 조용하다 싶으면 보호자가 한 번씩 가서 살펴봐주시면 사고치는 것을 예방할 수 있을 거예요. 너무 혼내지는 말아주세요. 새로운 자극을 받아들이는 방법을 터득하고 있으니까요.",
        "하지만 모든 자극을 긍정적으로 받아들이지 못해요. 보호자가 옆에 있으면서 보상과 함께 자극들에 대해서 긍정적으로 바꿔주세요. 그럼 세상에 있는 낯선 것들을 경계하는 일이 많이 줄어들 거랍니다.",
        "다양한 기회를 줌으로써 좀 더 능동적인 강아지가 될 수 있도록 도와주세요."
      ]
    },
    {
      "type": "EDR",
      "name": "견생 N회차 사교가",
      "best": "EDE",
      "worst": "IDE",
      "comments": [
        "견생 N회차 사교가는 외향적이지만 의존적인 모습을 보여주는 신중한 강아지예요.",
        "대부분의 상황에 대해서 의연하게 행동하는 모습을 보여주며 잘 적응해요. 낯선 것을 마주했을 때 곧잘 흥미를 느끼고 관찰하기 위해 다가가는 행동을 보여줘요. 또한 새로운 자극에도 금방 적응하기 때문에 새로운 경험을 하는데 많은 시간을 할애할 필요가 없어요.",
        "보호자에 대한 의존성이 제법 높기 때문에 보호자의 조금의 관심이라도 받으면 금방 기분이 좋아져요. 보호자에게 집중하고 노력하는 모습을 보이기 때문에 어떤 훈련이든 자신감있게 해낼 수 있어요.",
        "호기심이 많아서 행동이 먼저 앞서서 간혹 사고를 칠 때도 있을 거예요. 하지만 괜찮아요. 노즈워크나 등 놀이 체험을 해주다 보면 호기심을 다른 방향으로 틀어서 발산할 거니까요. 머리 쓰는 놀이가 잘 맞는 아주 현명한 강아지랍니다."
      ]
    },
    {
      "type": "EDE",
      "name": "뚜렷한 주관의 소유자",
      "best": "ILR",
      "worst": "ELR",
      "comments": [
        "뚜렷한 주관의 소유자는 자기 주관이 뚜렷한 똑똑한 강아지예요.",
        "본능이 강하지만 보호자에 대한 의존성도 강하기 때문에 먹을 것을 요구하거나 놀아달라고 하는 등의 의존적인 모습을 보일 수가 있어요. 산책과도 같은 신체적인 활동을 할 때 보호자를 자주 쳐다볼 거예요. 교감도가 높아서 보호자의 시그널을 금방 알아차린답니다.",
        "자기 주관이 뚜렷하기 때문에 고집 또한 강할 수 있어요. 눈치 또한 빨라서 병원같이 가기 싫은 곳에 가게 되면 금방 눈치를 채고 가지 않기를 원할 거예요. 이럴 때는 보호자의 말을 듣지 않을 수 있기 때문에 관련된 교육을 잘시켜줘야만 해요.",
        "병원에 대해서 좋은 경험과 좋은 기억을 많이 가지도록 하는 것이 중요해요. 나쁜 경험은 오래 가지고 있기 때문에 한 번 기억 속에 각인되게 되면 그 기억에서 벗어나는 것은 꽤 힘들 수가 있어요."
      ]
    },
    {
      "type": "ELR",
      "name": "꿈을 품은 지도자",
      "best": "IDE",
      "worst": "IDR",
      "comments": [
        "꿈을 품은 지도자는 활기찬 모습을 보여주는 아주 발랄한 강아지예요.",
        "주도적인 면모를 가지고 있기 때문에 산책과 같은 신체적인 활동을 할 때는 전혀 지칠 줄 모르는 에너자이저랍니다. 체력이 좋은 편이기 때문에 움직이는 시간이 많아요. 모든 일에도 적극적이며 보호자와의 교감도도 높은 편이에요.",
        "다른 친구들을 만나도 겁을 먹지 않으며 모임에서 리더가 되고 싶어하는 욕구가 있고 언제나 자신감에 차있어요. 높은 수준의 에너지를 가졌기 때문에 다른 친구들에게도 인기가 많아요. 보호자와 산책을 나가면 오히려 보호자를 이끌고 나가는 성향이 더 강해서 가끔은 보호자가 힘들 때가 있지만 행복하니 괜찮아요.",
        "대체로 보호자 외 사람들에게도 우호적인 성향을 가지고 있지만 때로는 혼자 있는 시간이 필요해요. 스스로 생각을 할 줄 알기 때문에 차분하게 교육을 시키면 잘 따라오는 영특한 강아지랍니다."
      ]
    },
    {
      "type": "ELE",
      "name": "주도적인 갱얼쥐",
      "best": "ILE",
      "worst": "EDE",
      "comments": [
        "주도적인 갱얼쥐는 활동력이 아주 높은 행복한 강아지예요.",
        "높은 수준의 에너지를 가지고 있기 때문에 체력을 소모하는 일을 굉장히 좋아해요. 산책이나 운동같은 신체적으로 움직일 수 있는 활동을 좋아해서 매일 규칙적으로 해줘야 해요. 친구들과 노는 것을 좋아하기 때문에 온몸으로 교감을 표현한답니다.",
        "활동력이 강한만큼 활동성을 분출해야만 하는 놀이활동을 좋아하고 성취감도 얻을 수 있다면 더 좋아해요. 자기 주도적인 모습이 있다보니 어질리티 등의 독 스포츠를 시키면 굉장히 좋아할 거예요.",
        "새로운 환경에도 두려움을 느끼지 않아서 환경에 대한 적응력이 굉장히 뛰어나요. 호기심도 강해서 다른 친구들의 정보를 습득하는 것을 좋아하는 행복 가득한 강아지예요."
      ]
    }
  ]
}